entries/imadenale.org
#+hugo_base_dir: ../
#+startup: content
#+macro: latex @@html:<span class="latex">L<sup>A</sup>T<sub>E</sub>X</span>@@
#+options: ^:{}
#+macro: srclink (eval (org-hugo-get-link-to-orgfile "https://github.com/takaxp/blog/blame/master/entries/" "see Orgfile"))
#+link: files https://raw.githubusercontent.com/takaxp/takaxp.github.io/master/files

** DONE インラインパッチ付きmacOS用Emacs頒布                         :@emacs:
   CLOSED: [2021-04-02 Fri 12:04]
:PROPERTIES:
:EXPORT_FILE_NAME: 0402-emacs-inline-package-dist
:EXPORT_HUGO_TAGS: "emacs"
:EXPORT_HUGO_LASTMOD: 
:EXPORT_HUGO_IMAGES: 
:ID:       B247EB6F-2B2B-4746-BFD9-B4C834A16507
:CREATED:  [2021-04-02 Fri 11:52]
:END:

以前から個人的にメンテナンスしている macOS向けEmacs NSビルド用の[[https://github.com/takaxp/ns-inline-patch][インラインパッチ]]ですが、 Emacs 27.2 のリリースに合わせて Apple Silicon でビルドしたパッケージの頒布も開始しました。Big Surでのみ動作します。Intelチップ用ビルドもありますが、そちらは Mojave/Catalina/Big Surで動作します。

 - https://github.com/takaxp/ns-inline-patch#pre-built-distribution-package

インラインパッチの内容は 27.1 から変更がなく、以前のパッチをそのまま適用しています。その一方で、ビルド済みパッケージは、C実装（Native）のJSONパーサである =jansson= も同梱物として含めることにしました。 =GnuTLS= については、以前と変わらず同梱しています。

Emacs EMPビルドの方は [[https://developer.apple.com/jp/metal/][metal]] に対応するなど、活発な活動状況だと思います。

*** References
 - [[https://github.com/takaxp/ns-inline-patch]]
 - [[https://qiita.com/takaxp/items/e07bb286d80fa9dd8e05][Emacs-25.3/26.3(Mojave, Catalina, BigSur)/27.2/28.x にインラインパッチをあてて使う（macOS）]]
 - [[https://lists.gnu.org/archive/html/emacs-devel/2021-03/msg01249.html][Emacs 27.2 is released]]
 - [[https://lists.gnu.org/archive/html/emacs-devel/2021-03/msg01331.html][Re: Emacs Mac port]]
 - [[https://digip.org/jansson/][jansson]]
